{
  "menu": {
    "about": "About",
    "skills": "Skills",
    "experience": "Experience",
    "projects": "Projects"
  },
  "about": {
    "name": "Cristian Mendoza",
    "role": "Full Stack Developer at Appears",
    "bio1": "Since 2016 I entered the world of software development, I always had a taste for technology, as well as a lot of curiosity about websites and how they work.",
    "bio2": "I currently work as a Full Stack developer, using technologies such as Vue.js, Vuetify, Node.js, JavaScript, MongoDB, AWS and Amazon DynamoDB. My main responsibility is to carry out the implementation of the project according to its requirements and the previously agreed design.",
    "bio3": "My focus is always on facing any challenge with the highest level of commitment, making proposals to meet each solution so that they make a difference. I really like being able to contribute something good and that each member of the team feels comfortable working with me in creating solutions."
  },
  "switcher": {
    "es": "Español",
    "en": "English"
  },
  "skills": {
    "title": "Skills",
    "categories": {
      "languages": "Languages",
      "frameworks": "Frameworks",
      "tools": "Tools",
      "design": "Design"
    }
  },
  "experience": {
    "title": "Experience",
    "items": {
      "parking": {
        "title": "Full Stack Developer",
        "company": "Parking International",
        "description": "As a Full Stack developer I have found the challenge of working without the requirements defined as such and in a system that had apparently been in development for 2 to 3 years, but due to reprocessing and changes it had never been possible to reach a first version, me as the only developer doing front and back, with the help of other backs and working based on flow charts, meetings with the team and stakeholders, we have managed to get an MVP in a period of 6 months, after the team was making better decisions for the project.",
        "date": "May 2023 - Present"
      },
      "macarenia": {
        "title": "Frontend Developer",
        "company": "Macarenia Corp",
        "description": "Migration and frontend development with React JS, receipt of requirements submissions, validation and design proposals to improve the system under development.",
        "date": "Feb 2023 - May 2023"
      },
      "appears": {
        "title": "Frontend Developer",
        "company": "Appears",
        "description": "Develop and restructure custom systems, web pages and landing pages for clients and the company itself, as well as sporadically support the design of user interfaces or redesign of system modules and the company's app.",
        "date": "October 2020 - March 2023"
      },
      "eltiempo": {
        "title": "Software Developer",
        "company": "El Tiempo Casa Editorial",
        "description": "My functions were to support databases, create ETL's and migrate ETL's from one version of Visual Studio to another, test EL TIEMPO CASA EDITORIAL applications, load into test and production databases, design and development of user interfaces.",
        "date": "December 2020 - June 2020"
      }
    }
  },
  "projects": {
    "title": "Projects",
    "items": {
      "comercia": {
        "title": "Comercia en linea (Trade Online)",
        "position": "Analyst - Designer - Full Stack Developer - Tester - Devops - WaterBoy",
        "description": "Analysis, design, development, implementation, testing, maintenance and support, this project is my author and I created it in order to go through different phases of software development learning and fully maintaining my general knowledge of the software development life cycle software."
      },
      "blomi": {
        "title": "Blomi - Inside",
        "position": "Full Stack Developer",
        "description": "Development of inside, a system for the administrative management of the Parking International company that is developed at the same time as other technological proposals such as end customer App, operator App, corporate client platform."
      },
      "bia": {
        "title": "Bia",
        "position": "Front End Developer",
        "description": "Migration and frontend development with React JS, receipt of requirements submissions, validation and design proposals to improve the system under development."
      },
      "qinspecting": {
        "title": "Qinspecting",
        "position": "Front End Developer",
        "description": "General style adjustments due to UI/UX restructuring, in addition to implementation of modules such as notifications, training, adjustment in the authentication module and creation of the service website."
      }
    }
  },
  "teams": {
    "title": "Work Teams",
    "description": "I have had the privilege of working with incredible teams in different companies, where we have achieved successful projects and learned together.",
    "items": {
      "empresa_a": {
        "company": "Parking International",
        "description": "Software development team."
      },
      "empresa_b": {
        "company": "Parking International",
        "description": "Software development team."
      },
      "empresa_c": {
        "company": "Parking International",
        "description": "Administrative team and TI."
      },
      "empresa_d": {
        "company": "Parking International",
        "description": "Technology team."
      }
    }
  }
}
